#pragma once

//******************************************************************************
//
//
//      common
//
//
//******************************************************************************

//------< インクルード >---------------------------------------------------------
#include <DirectXMath.h>

//------< 関数ポインタ >---------------------------------------------------------
extern float (*ToRadian)(float); // 角度をラジアンに
extern float (*ToDegree)(float); // ラジアンを角度に

extern constexpr float PI = DirectX::XM_PI;
