//******************************************************************************
//
//
//      シーン管理
//
//
//******************************************************************************

//------< インクルード >----------------------------------------------------------
#include "all.h"

//==============================================================================
//
//      Sceneクラス
//
//==============================================================================

//--------------------------------------------------------------
//  実行
//--------------------------------------------------------------
Scene* Scene::execute()
{
    using namespace GameLib;

    // 初期化処理
    init();

    // ゲームループ
    while (GameLib::gameLoop(false))    // falseをtrueにするとタイトルバーにフレームレート表示
    {
        // 入力処理
        input::update();

        // 更新処理
        update();

        // ステンシルモード：通常
        DepthStencil::instance().set(DepthStencil::MODE::NONE);

        // 描画処理
        draw();

        // ステンシルモード：通常
        DepthStencil::instance().set(DepthStencil::MODE::NONE);

        // デバッグ文字列の描画
        debug::display(0, 0, 0, 1.5f, 1.5f);
        
        // debug::display(1, 0.6f, 0, 1.5f, 1.5f);
        // debug::setString("GP2_10 SAMPLE");

        // 画面フリップ
        GameLib::present(1, 0);

        // 終了チェック
        if (nextScene_) break;
    }

    // 終了処理
    deinit();

    return nextScene_;	// 次のシーンを返す
}

//******************************************************************************
//
//      SceneManagerクラス
//
//******************************************************************************

//--------------------------------------------------------------
//  実行
//--------------------------------------------------------------
void SceneManager::execute(Scene* scene)
{
    using namespace GameLib;

    bool isFullScreen = true;	// フルスクリーンにするならtrueに変える
                                //（Releaseモードのみ）

    // ゲームライブラリの初期化処理
    GameLib::init(L"忍者楽", BG::WINDOW_W, BG::WINDOW_H, isFullScreen);

#ifndef _DEBUG
    ShowCursor(!isFullScreen);	// フルスクリーン時はカーソルを消す
#endif
    //テクスチャの読み込み
    texture::load(loadTexture);

    //音楽読み込み
    audio.init();

    // メインループ
    while (scene)
    {
        scene = scene->execute();
    }

    //テクスチャの解放
    texture::releaseAll();

    //音楽クリア
    audio.deinit();

    // ゲームライブラリの終了処理
    GameLib::uninit();
}

//******************************************************************************
